<?php
/**********************************************************************
 *			               А Н К Е Т А
 *  "Устранение потерь от неполного раскрытия потенциала сотрудников" 
 * ==================================================================
 *                     Форма не разработана
 * 
 * @file views/underConstruction.php
 * @version 0.0.1
 *
 * @author Александр Васильков
 * @author Home Lab, Пенза (с), 2023
 * @author E-Mail bac@sura.ru
 *
 * @date 24.11.2023
 *
 ***********************************************************************/

/** @var yii\web\View $this */

use yii\helpers\Html;

$this->title = 'Форма не разработана ...';
$this->params['breadcrumbs'][] = $this->title;
?>
<h1><?= Html::encode($this->title) ?></h1>
