@Echo off
Rem  ***************************************************************************
Rem  *			               М Е М О Р И А Л
Rem  *         Мемориал участников во Второй мировой войне 
Rem  *	   =============================================
Rem  *
Rem  * Пакетный файл: backup.bat
Rem  * Функции:       Резервное копирование базы данных
Rem  * Параметры:     Дата файла 
Rem  * ------------------------------------------------------------------------
Rem  * Авторство:   ИП "HOME LAB", Пенза (с), 2025
Rem  * Разработчик: Александр Васильков
Rem  * E-Mail:	    bac@sura.ru
Rem  * ------------------------------------------------------------------------
Rem  * Версия: 0.0.1
Rem  * Дата:   06.09.2025
Rem  ***************************************************************************

Rem  Здесь нужно установить тербуемые значения
Rem  ==========================================
REM SET MyPath=C:\Program Files\MariaDB 10.1
SET  MyPath=C:\Program Files\MySQL\MySQL Server 8.2
ECHO %MyPath%

SET MyUser=root
SET MyPassword=123456
SET DbName=memorial
Rem  ==========================================
"%MyPath%\bin\MySQLDump.exe" --password=%MyPassword% --user=%MyUser%  %DbName% > memDump%1.sql
